In [0]:
import pandas as pd

In [0]:

#reading data from csv file
df = pd.read_csv('com.csv')

In [0]:
#shows data structure
df.info

<bound method DataFrame.info of             Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50>

In [0]:
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [0]:
#top 3 rows
df.head(3)

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100

In [0]:
# particular column
df['Name']

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [0]:
# for selecting rows and columns
df.iloc[0:,0]

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [0]:
df.iloc[0:,0:2]

            Name Department
0     Robin Hood        NaN
1  Arsene Wenger        Bar
2     Friar Tuck        Foo
3    Little John        Foo
4  Sam Allardyce        NaN
5  Dimi Berbatov        Foo

In [0]:
df.iloc[0:,[0,3]]

            Name  Salary
0     Robin Hood     200
1  Arsene Wenger      50
2     Friar Tuck     100
3    Little John     100
4  Sam Allardyce     250
5  Dimi Berbatov      50

In [0]:
# salary
df['Salary']

0    200
1     50
2    100
3    100
4    250
5     50
Name: Salary, dtype: int64

In [0]:
# max salary
df['Salary'].max()

250

In [0]:
df.values

array([['Robin Hood', nan, nan, 200],
       ['Arsene Wenger', 'Bar', 'Friar Tuck', 50],
       ['Friar Tuck', 'Foo', 'Robin Hood', 100],
       ['Little John', 'Foo', 'Robin Hood', 100],
       ['Sam Allardyce', nan, nan, 250],
       ['Dimi Berbatov', 'Foo', 'Little John', 50]], dtype=object)